docs: Use mermaid diagrams
